TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_SPMTERASE5 Bits */
/* LFSS_SPMTERASE5[KEY] Bits */
#define LFSS_SPMTERASE5_KEY_OFS                  (24)                            /* !< KEY Offset */
#define LFSS_SPMTERASE5_KEY_MASK                 ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xA3) to update
                                                                                    this register */
#define LFSS_SPMTERASE5_KEY_UNLOCK_W             ((uint32_t)0xA3000000U)         /* !< This field must be written with
                                                                                    0xA3 to be update the tamper erase
                                                                                    enable bit. */
/* LFSS_SPMTERASE5[TE_23_3] Bits */
#define LFSS_SPMTERASE5_TE_23_3_OFS              (15)                            /* !< TE_23_3 Offset */
#define LFSS_SPMTERASE5_TE_23_3_MASK             ((uint32_t)0x00008000U)         /* !< tamper erase enable SPMEM23 - DATA3 */
#define LFSS_SPMTERASE5_TE_23_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE5_TE_23_3_ENABLE           ((uint32_t)0x00008000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE5[TE_23_2] Bits */
#define LFSS_SPMTERASE5_TE_23_2_OFS              (14)                            /* !< TE_23_2 Offset */
#define LFSS_SPMTERASE5_TE_23_2_MASK             ((uint32_t)0x00004000U)         /* !< tamper erase enable SPMEM23 - DATA2 */
#define LFSS_SPMTERASE5_TE_23_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE5_TE_23_2_ENABLE           ((uint32_t)0x00004000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE5[TE_23_1] Bits */
#define LFSS_SPMTERASE5_TE_23_1_OFS              (13)                            /* !< TE_23_1 Offset */
#define LFSS_SPMTERASE5_TE_23_1_MASK             ((uint32_t)0x00002000U)         /* !< tamper erase enable SPMEM23 - DATA1 */
#define LFSS_SPMTERASE5_TE_23_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE5_TE_23_1_ENABLE           ((uint32_t)0x00002000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE5[TE_23_0] Bits */
#define LFSS_SPMTERASE5_TE_23_0_OFS              (12)                            /* !< TE_23_0 Offset */
#define LFSS_SPMTERASE5_TE_23_0_MASK             ((uint32_t)0x00001000U)         /* !< tamper erase enable SPMEM23 - DATA0 */
#define LFSS_SPMTERASE5_TE_23_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE5_TE_23_0_ENABLE           ((uint32_t)0x00001000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE5[TE_22_3] Bits */
#define LFSS_SPMTERASE5_TE_22_3_OFS              (11)                            /* !< TE_22_3 Offset */
#define LFSS_SPMTERASE5_TE_22_3_MASK             ((uint32_t)0x00000800U)         /* !< tamper erase enable SPMEM22 - DATA3 */
#define LFSS_SPMTERASE5_TE_22_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE5_TE_22_3_ENABLE           ((uint32_t)0x00000800U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE5[TE_22_2] Bits */
#define LFSS_SPMTERASE5_TE_22_2_OFS              (10)                            /* !< TE_22_2 Offset */
#define LFSS_SPMTERASE5_TE_22_2_MASK             ((uint32_t)0x00000400U)         /* !< tamper erase enable SPMEM22 - DATA2 */
#define LFSS_SPMTERASE5_TE_22_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE5_TE_22_2_ENABLE           ((uint32_t)0x00000400U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE5[TE_22_1] Bits */
#define LFSS_SPMTERASE5_TE_22_1_OFS              (9)                             /* !< TE_22_1 Offset */
#define LFSS_SPMTERASE5_TE_22_1_MASK             ((uint32_t)0x00000200U)         /* !< tamper erase enable SPMEM22 - DATA1 */
#define LFSS_SPMTERASE5_TE_22_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE5_TE_22_1_ENABLE           ((uint32_t)0x00000200U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE5[TE_22_0] Bits */
#define LFSS_SPMTERASE5_TE_22_0_OFS              (8)                             /* !< TE_22_0 Offset */
#define LFSS_SPMTERASE5_TE_22_0_MASK             ((uint32_t)0x00000100U)         /* !< tamper erase enable SPMEM22 - DATA0 */
#define LFSS_SPMTERASE5_TE_22_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE5_TE_22_0_ENABLE           ((uint32_t)0x00000100U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE5[TE_21_3] Bits */
#define LFSS_SPMTERASE5_TE_21_3_OFS              (7)                             /* !< TE_21_3 Offset */
#define LFSS_SPMTERASE5_TE_21_3_MASK             ((uint32_t)0x00000080U)         /* !< tamper erase enable SPMEM21 - DATA3 */
#define LFSS_SPMTERASE5_TE_21_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE5_TE_21_3_ENABLE           ((uint32_t)0x00000080U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE5[TE_21_2] Bits */
#define LFSS_SPMTERASE5_TE_21_2_OFS              (6)                             /* !< TE_21_2 Offset */
#define LFSS_SPMTERASE5_TE_21_2_MASK             ((uint32_t)0x00000040U)         /* !< tamper erase enable SPMEM21 - DATA2 */
#define LFSS_SPMTERASE5_TE_21_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE5_TE_21_2_ENABLE           ((uint32_t)0x00000040U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE5[TE_21_1] Bits */
#define LFSS_SPMTERASE5_TE_21_1_OFS              (5)                             /* !< TE_21_1 Offset */
#define LFSS_SPMTERASE5_TE_21_1_MASK             ((uint32_t)0x00000020U)         /* !< tamper erase enable SPMEM21 - DATA1 */
#define LFSS_SPMTERASE5_TE_21_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE5_TE_21_1_ENABLE           ((uint32_t)0x00000020U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE5[TE_21_0] Bits */
#define LFSS_SPMTERASE5_TE_21_0_OFS              (4)                             /* !< TE_21_0 Offset */
#define LFSS_SPMTERASE5_TE_21_0_MASK             ((uint32_t)0x00000010U)         /* !< tamper erase enable SPMEM21 - DATA0 */
#define LFSS_SPMTERASE5_TE_21_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE5_TE_21_0_ENABLE           ((uint32_t)0x00000010U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE5[TE_20_3] Bits */
#define LFSS_SPMTERASE5_TE_20_3_OFS              (3)                             /* !< TE_20_3 Offset */
#define LFSS_SPMTERASE5_TE_20_3_MASK             ((uint32_t)0x00000008U)         /* !< tamper erase enable SPMEM20 - DATA3 */
#define LFSS_SPMTERASE5_TE_20_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE5_TE_20_3_ENABLE           ((uint32_t)0x00000008U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE5[TE_20_2] Bits */
#define LFSS_SPMTERASE5_TE_20_2_OFS              (2)                             /* !< TE_20_2 Offset */
#define LFSS_SPMTERASE5_TE_20_2_MASK             ((uint32_t)0x00000004U)         /* !< tamper erase enable SPMEM20 - DATA2 */
#define LFSS_SPMTERASE5_TE_20_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE5_TE_20_2_ENABLE           ((uint32_t)0x00000004U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE5[TE_20_1] Bits */
#define LFSS_SPMTERASE5_TE_20_1_OFS              (1)                             /* !< TE_20_1 Offset */
#define LFSS_SPMTERASE5_TE_20_1_MASK             ((uint32_t)0x00000002U)         /* !< tamper erase enable SPMEM20 - DATA1 */
#define LFSS_SPMTERASE5_TE_20_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE5_TE_20_1_ENABLE           ((uint32_t)0x00000002U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE5[TE_20_0] Bits */
#define LFSS_SPMTERASE5_TE_20_0_OFS              (0)                             /* !< TE_20_0 Offset */
#define LFSS_SPMTERASE5_TE_20_0_MASK             ((uint32_t)0x00000001U)         /* !< tamper erase enable SPMEM20 - DATA0 */
#define LFSS_SPMTERASE5_TE_20_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE5_TE_20_0_ENABLE           ((uint32_t)0x00000001U)         /* !< SPMEM will be erased with tamper
                                                                                    event */

/* LFSS_SPMTERASE6 Bits */
/* LFSS_SPMTERASE6[KEY] Bits */
#define LFSS_SPMTERASE6_KEY_OFS                  (24)                            /* !< KEY Offset */
#define LFSS_SPMTERASE6_KEY_MASK                 ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xA3) to update
                                                                                    this register */
#define LFSS_SPMTERASE6_KEY_UNLOCK_W             ((uint32_t)0xA3000000U)         /* !< This field must be written with
                                                                                    0xA3 to be update the tamper erase
                                                                                    enable bit. */
/* LFSS_SPMTERASE6[TE_27_3] Bits */
#define LFSS_SPMTERASE6_TE_27_3_OFS              (15)                            /* !< TE_27_3 Offset */
#define LFSS_SPMTERASE6_TE_27_3_MASK             ((uint32_t)0x00008000U)         /* !< tamper erase enable SPMEM27 - DATA3 */
#define LFSS_SPMTERASE6_TE_27_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE6_TE_27_3_ENABLE           ((uint32_t)0x00008000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE6[TE_27_2] Bits */
#define LFSS_SPMTERASE6_TE_27_2_OFS              (14)                            /* !< TE_27_2 Offset */
#define LFSS_SPMTERASE6_TE_27_2_MASK             ((uint32_t)0x00004000U)         /* !< tamper erase enable SPMEM27 - DATA2 */
#define LFSS_SPMTERASE6_TE_27_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE6_TE_27_2_ENABLE           ((uint32_t)0x00004000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE6[TE_27_1] Bits */
#define LFSS_SPMTERASE6_TE_27_1_OFS              (13)                            /* !< TE_27_1 Offset */
#define LFSS_SPMTERASE6_TE_27_1_MASK             ((uint32_t)0x00002000U)         /* !< tamper erase enable SPMEM27 - DATA1 */
#define LFSS_SPMTERASE6_TE_27_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE6_TE_27_1_ENABLE           ((uint32_t)0x00002000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE6[TE_27_0] Bits */
#define LFSS_SPMTERASE6_TE_27_0_OFS              (12)                            /* !< TE_27_0 Offset */
#define LFSS_SPMTERASE6_TE_27_0_MASK             ((uint32_t)0x00001000U)         /* !< tamper erase enable SPMEM27 - DATA0 */
#define LFSS_SPMTERASE6_TE_27_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE6_TE_27_0_ENABLE           ((uint32_t)0x00001000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE6[TE_26_3] Bits */
#define LFSS_SPMTERASE6_TE_26_3_OFS              (11)                            /* !< TE_26_3 Offset */
#define LFSS_SPMTERASE6_TE_26_3_MASK             ((uint32_t)0x00000800U)         /* !< tamper erase enable SPMEM26 - DATA3 */
#define LFSS_SPMTERASE6_TE_26_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE6_TE_26_3_ENABLE           ((uint32_t)0x00000800U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE6[TE_26_2] Bits */
#define LFSS_SPMTERASE6_TE_26_2_OFS              (10)                            /* !< TE_26_2 Offset */
#define LFSS_SPMTERASE6_TE_26_2_MASK             ((uint32_t)0x00000400U)         /* !< tamper erase enable SPMEM26 - DATA2 */
#define LFSS_SPMTERASE6_TE_26_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE6_TE_26_2_ENABLE           ((uint32_t)0x00000400U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE6[TE_26_1] Bits */
#define LFSS_SPMTERASE6_TE_26_1_OFS              (9)                             /* !< TE_26_1 Offset */
#define LFSS_SPMTERASE6_TE_26_1_MASK             ((uint32_t)0x00000200U)         /* !< tamper erase enable SPMEM26 - DATA1 */
#define LFSS_SPMTERASE6_TE_26_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE6_TE_26_1_ENABLE           ((uint32_t)0x00000200U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE6[TE_26_0] Bits */
#define LFSS_SPMTERASE6_TE_26_0_OFS              (8)                             /* !< TE_26_0 Offset */
#define LFSS_SPMTERASE6_TE_26_0_MASK             ((uint32_t)0x00000100U)         /* !< tamper erase enable SPMEM26 - DATA0 */
#define LFSS_SPMTERASE6_TE_26_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE6_TE_26_0_ENABLE           ((uint32_t)0x00000100U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE6[TE_25_3] Bits */
#define LFSS_SPMTERASE6_TE_25_3_OFS              (7)                             /* !< TE_25_3 Offset */
#define LFSS_SPMTERASE6_TE_25_3_MASK             ((uint32_t)0x00000080U)         /* !< tamper erase enable SPMEM25 - DATA3 */
#define LFSS_SPMTERASE6_TE_25_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE6_TE_25_3_ENABLE           ((uint32_t)0x00000080U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE6[TE_25_2] Bits */
#define LFSS_SPMTERASE6_TE_25_2_OFS              (6)                             /* !< TE_25_2 Offset */
#define LFSS_SPMTERASE6_TE_25_2_MASK             ((uint32_t)0x00000040U)         /* !< tamper erase enable SPMEM25 - DATA2 */
#define LFSS_SPMTERASE6_TE_25_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE6_TE_25_2_ENABLE           ((uint32_t)0x00000040U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE6[TE_25_1] Bits */
#define LFSS_SPMTERASE6_TE_25_1_OFS              (5)                             /* !< TE_25_1 Offset */
#define LFSS_SPMTERASE6_TE_25_1_MASK             ((uint32_t)0x00000020U)         /* !< tamper erase enable SPMEM25 - DATA1 */
#define LFSS_SPMTERASE6_TE_25_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE6_TE_25_1_ENABLE           ((uint32_t)0x00000020U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE6[TE_25_0] Bits */
#define LFSS_SPMTERASE6_TE_25_0_OFS              (4)                             /* !< TE_25_0 Offset */
#define LFSS_SPMTERASE6_TE_25_0_MASK             ((uint32_t)0x00000010U)         /* !< tamper erase enable SPMEM25 - DATA0 */
#define LFSS_SPMTERASE6_TE_25_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE6_TE_25_0_ENABLE           ((uint32_t)0x00000010U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE6[TE_24_3] Bits */
#define LFSS_SPMTERASE6_TE_24_3_OFS              (3)                             /* !< TE_24_3 Offset */
#define LFSS_SPMTERASE6_TE_24_3_MASK             ((uint32_t)0x00000008U)         /* !< tamper erase enable SPMEM24 - DATA3 */
#define LFSS_SPMTERASE6_TE_24_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE6_TE_24_3_ENABLE           ((uint32_t)0x00000008U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE6[TE_24_2] Bits */
#define LFSS_SPMTERASE6_TE_24_2_OFS              (2)                             /* !< TE_24_2 Offset */
#define LFSS_SPMTERASE6_TE_24_2_MASK             ((uint32_t)0x00000004U)         /* !< tamper erase enable SPMEM24 - DATA2 */
#define LFSS_SPMTERASE6_TE_24_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE6_TE_24_2_ENABLE           ((uint32_t)0x00000004U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE6[TE_24_1] Bits */
#define LFSS_SPMTERASE6_TE_24_1_OFS              (1)                             /* !< TE_24_1 Offset */
#define LFSS_SPMTERASE6_TE_24_1_MASK             ((uint32_t)0x00000002U)         /* !< tamper erase enable SPMEM24 - DATA1 */
#define LFSS_SPMTERASE6_TE_24_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE6_TE_24_1_ENABLE           ((uint32_t)0x00000002U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE6[TE_24_0] Bits */
#define LFSS_SPMTERASE6_TE_24_0_OFS              (0)                             /* !< TE_24_0 Offset */
#define LFSS_SPMTERASE6_TE_24_0_MASK             ((uint32_t)0x00000001U)         /* !< tamper erase enable SPMEM24 - DATA0 */
#define LFSS_SPMTERASE6_TE_24_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE6_TE_24_0_ENABLE           ((uint32_t)0x00000001U)         /* !< SPMEM will be erased with tamper
                                                                                    event */

